---
kind: type
id: T:Autodesk.Revit.UI.RadioButtonGroupData
source: html/eeda7b4e-226f-b9a2-12d8-6768d295ca4a.htm
---
# Autodesk.Revit.UI.RadioButtonGroupData

This class contains information necessary to construct a ribbon gallery in the Ribbon.

## Syntax (C#)
```csharp
public class RadioButtonGroupData : RibbonItemData
```